---
kind: type
id: T:Autodesk.Revit.DB.DirectShapeOptions
source: html/be2135fc-6e44-0557-3fed-c91306ec2084.htm
---
# Autodesk.Revit.DB.DirectShapeOptions

This class is used to control behavior of a DirectShape object.

## Syntax (C#)
```csharp
public class DirectShapeOptions : IDisposable
```

## Remarks
Use Enable/Disable functions to change the default behavior.
 Use DirectShape.SetOptions to modify that object's behavior.